import random

DEFAULT_MIDDLE_NAMES = (
    "Александрович", "Алексеевич", "Анатольевич", "Андреевич", "Антонович", "Аркадьевич", "Артемович",
    "Бедросович", "Богданович", "Борисович", "Валентинович", "Валерьевич", "Васильевич", "Викторович",
    "Витальевич", "Владимирович", "Владиславович", "Вольфович", "Вячеславович", "Геннадиевич", "Георгиевич",
    "Григорьевич", "Данилович", "Денисович", "Дмитриевич", "Евгеньевич", "Егорович", "Ефимович", "Иванович",
    "Иваныч", "Игнатьевич", "Игоревич", "Ильич", "Иосифович", "Исаакович", "Кириллович", "Константинович",
    "Леонидович", "Львович", "Максимович", "Матвеевич", "Михайлович", "Николаевич", "Олегович", "Павлович",
    "Палыч", "Петрович", "Платонович", "Робертович", "Романович", "Саныч", "Северинович", "Семенович",
    "Сергеевич", "Станиславович", "Степанович", "Тарасович", "Тимофеевич", "Федорович", "Феликсович",
    "Филиппович", "Эдуардович", "Юрьевич", "Яковлевич", "Ярославович")


class MiddleNameGenerator:
    def __init__(self,
                 available_middle_names: tuple = DEFAULT_MIDDLE_NAMES):
        self.available_middle_names = available_middle_names

    def generate(self) -> str:
        return random.choice(self.available_middle_names)


if __name__ == "__main__":
    middle_name_generator = MiddleNameGenerator()
    print(middle_name_generator.generate())

    middle_name_generator_with_my_middle_names = MiddleNameGenerator(('Джонович', 'Альбертович', 'Рюрикович'))
    print(middle_name_generator_with_my_middle_names.generate())
